# PANDAS - DAY 3 ( TIPS AND TRICKS )

## Table of Contents:

[1. how-to-find-the-version](#01--how-to-find-the-version)\
[2. making-a-data-frame](#02--making-a-data-frame)\
[3. using-numpy-to-create-dataframe](#3--using-numpy-to-create-dataframe)\
[4. sing-template-data](#4-using-template-data)\
[5. using-your-own-data](#5-using-your-own-data)\
[6. reverse-row-order](#6-reverse-row-order)\
[7. reverse-colun-order](#7--reverse-colun-order)\
[8. select-a-cloumn-by-a-data-type](#8--select-a-cloumn-by-a-data-type)\
[9. convert-numbers-into-strings](#9--convert-numbers-into-strings)\
[10. reduce-dataframe-size](#10--reduce-dataframe-size)\
[11. copy-data-from-clipboard](#11--copy-data-from-clipboard)\
[12. split-data-sets-in-two-frames](#12---split-data-sets-in-two-frames)\
[13. joining-dataset-into-one-dataframe](#13---joining-dataset-into-one-dataframe)\
[14. filtering-a-data-set](#14---filtering-a-data-set)\
[15. filtering-by-large-categories](#15-filtering-by-large-categories)\
[16. splitting-a-string-into-multiple-cloumns](#16---splitting-a-string-into-multiple-cloumns)\
[17. aggregate-by-multiple-groupsfunctions](#17---aggregate-by-multiple-groupsfunctions)\
[18. select-specific-rows-and-columns](#18---select-specific-rows-and-columns)

### 01 . How to find the version?

In [1]:
import pandas as pd

In [2]:
pd.__version__

'1.5.3'

In [3]:
pd.show_versions()

c:\Users\Administrator\AppData\Local\Programs\Python\Python311\Lib\site-packages\_distutils_hack\__init__.py:33: UserWarning: Setuptools is replacing distutils.
  warnings.warn("Setuptools is replacing distutils.")

INSTALLED VERSIONS
------------------
commit           : 2e218d10984e9919f0296931d92ea851c6a6faf5
python           : 3.11.1.final.0
python-bits      : 64
OS               : Windows
OS-release       : 10
Version          : 10.0.22000
machine          : AMD64
processor        : Intel64 Family 6 Model 78 Stepping 3, GenuineIntel
byteorder        : little
LC_ALL           : None
LANG             : None
LOCALE           : English_United States.1252

pandas           : 1.5.3
numpy            : 1.24.2
pytz             : 2022.7.1
dateutil         : 2.8.2
setuptools       : 65.5.0
pip              : 23.1.2
Cython           : None
pytest           : None
hypothesis       : None
sphinx           : None
blosc            : None
feather          : None
xlsxwriter       : None
lxml.etree       : None
html5lib         : None
pymysql          : None
psycopg2         : None
jinja2           : 3.1.2
IPython          : 8.13.2
pandas_datareader: None
bs4              : 4.11.2
bottleneck       : None
brotli           : None
fastparquet      : None
fsspec           : None
gcsfs            : None
matplotlib       : 3.7.1
numba            : None
numexpr          : None
odfpy            : None
openpyxl         : 3.1.2
pandas_gbq       : None
pyarrow          : None
pyreadstat       : None
pyxlsb           : None
s3fs             : None
scipy            : None
snappy           : None
sqlalchemy       : None
tables           : None
tabulate         : None
xarray           : None
xlrd             : None
xlwt             : None
zstandard        : None
tzdata           : None

### 02- Making a Data Frame

In [4]:
df=pd.DataFrame({'Name ':["Uzair","Abbas","Lahad","Razi","Bilal"],'Age ': [20,19,21,22,19]})

In [5]:
df

   Name   Age
0  Uzair    20
1  Abbas    19
2  Lahad    21
3   Razi    22
4  Bilal    19

In [6]:
df.head()

   Name   Age
0  Uzair    20
1  Abbas    19
2  Lahad    21
3   Razi    22
4  Bilal    19

In [7]:
df.tail()

   Name   Age
0  Uzair    20
1  Abbas    19
2  Lahad    21
3   Razi    22
4  Bilal    19

In [8]:
df

   Name   Age
0  Uzair    20
1  Abbas    19
2  Lahad    21
3   Razi    22
4  Bilal    19

# 3- using numpy to create dataframe

In [9]:
# numpy array to create dataframe
import numpy as np
arr=np.array([['Uzair',20],['Abbas',19],['Lahad',21],['Razi',22],['Bilal',19]])
# arr
df=pd.DataFrame(arr,columns=['Name','Age'])
df

    Name Age
0  Uzair  20
1  Abbas  19
2  Lahad  21
3   Razi  22
4  Bilal  19

In [10]:
# numpy array data frame
pd.DataFrame(np.random.rand(5,2))
pd.DataFrame(np.random.rand(5,2), columns=list("AB"))

          A         B
0  0.135874  0.724882
1  0.747026  0.630566
2  0.043767  0.424784
3  0.605738  0.886657
4  0.126661  0.031505

In [11]:
pd.DataFrame(np.random.rand(50,20))

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19
0,0.452459,0.260986,0.583004,0.136140,0.844139,0.424571,0.066623,0.571623,0.537877,0.232580,0.678585,0.469841,0.134049,0.083103,0.616347,0.070429,0.816760,0.637399,0.433153,0.418278
1,0.898085,0.508078,0.108368,0.131996,0.028894,0.522368,0.209034,0.490054,0.056432,0.792327,0.534312,0.457054,0.565846,0.628945,0.894335,0.509303,0.356243,0.692159,0.936902,0.000968
2,0.452432,0.196265,0.599908,0.164111,0.333929,0.873421,0.076086,0.811013,0.420332,0.542193,0.702576,0.396120,0.335665,0.391817,0.214947,0.184667,0.890722,0.790929,0.012684,0.193401
3,0.031544,0.047024,0.865891,0.416254,0.016497,0.832945,0.875832,0.465724,0.587560,0.013581,0.703175,0.100109,0.056141,0.486994,0.982800,0.527573,0.504863,0.209409,0.079595,0.088572
4,0.440636,0.944813,0.656815,0.220474,0.727914,0.886504,0.858646,0.800196,0.201888,0.483804,0.554635,0.456714,0.228148,0.456007,0.078744,0.095013,0.398561,0.234262,0.570969,0.763922
5,0.971854,0.886269,0.998276,0.263369,0.075267,0.308177,0.163152,0.911659,0.829622,0.904297,0.322780,0.528904,0.124593,0.741807,0.145330,0.838032,0.436958,0.262823,0.049899,0.703905
6,0.868462,0.403052,0.481767,0.543041,0.221626,0.462336,0.485135,0.229078,0.759757,0.827341,0.311889,0.475217,0.345764,0.085198,0.016716,0.178194,0.233328,0.069277,0.806668,0.555156
7,0.506873,0.381473,0.282916,0.761622,0.883102,0.487555,0.404642,0.173142,0.621549,0.863297,0.891293,0.932406,0.896834,0.550435,0.784467,0.579518,0.092393,0.071253,0.381722,0.439447
8,0.679753,0.052505,0.886574,0.528029,0.663650,0.114230,0.127139,0.993954,0.739653,0.676613,0.048386,0.343182,0.284721,0.574931,0.637241,0.968328,0.157682,0.788362,0.706939,0.717960
9,0.351294,0.631184,0.061270,0.530504,0.729687,0.794295,0.228171,0.350063,0.914977,0.178558,0.532749,0.590276,0.163190,0.490952,0.594576,0.340088,0.160625,0.785677,0.365725,0.323416
10,0.311662,0.045893,0.883551,0.367968,0.876237,0.905896,0.514755,0.196771,0.125788,0.498568,0.964748,0.108154,0.553810,0.199625,0.369001,0.893842,0.759668,0.702650,0.665364,0.465901
11,0.129244,0.461336,0.087552,0.067762,0.608061,0.451751,0.657478,0.254898,0.272956,0.416568,0.750573,0.594132,0.317608,0.332979,0.356403,0.691092,0.348501,0.145259,0.687930,0.561210
12,0.435654,0.447287,0.382910,0.124231,0.679179,0.900959,0.358506,0.115123,0.008145,0.865855,0.882536,0.048519,0.075055,0.876173,0.168643,0.585932,0.676575,0.515929,0.637878,0.037549
13,0.360287,0.913302,0.678225,0.503640,0.137395,0.913214,0.775634,0.894080,0.441735,0.827339,0.793121,0.612939,0.675912,0.245405,0.906816,0.791659,0.360053,0.298762,0.204821,0.823909
14,0.686662,0.877788,0.083804,0.802854,0.466248,0.945098,0.926384,0.122261,0.871310,0.742630,0.952364,0.899859,0.694808,0.749403,0.960278,0.960868,0.218944,0.739155,0.693572,0.016835
15,0.993630,0.932676,0.092621,0.749162,0.738459,0.892437,0.922594,0.081707,0.450599,0.822550,0.879134,0.041345,0.125921,0.111695,0.211449,0.302658,0.976667,0.237291,0.648930,0.212825
16,0.427412,0.565770,0.888716,0.566681,0.755042,0.135458,0.417611,0.039754,0.251691,0.153402,0.822196,0.206063,0.954431,0.980288,0.907285,0.718926,0.428742,0.567949,0.080638,0.532005
17,0.783628,0.703938,0.833581,0.395452,0.109841,0.956765,0.249965,0.671179,0.147848,0.750584,0.957336,0.466296,0.645666,0.589027,0.411222,0.975525,0.215705,0.254440,0.078778,0.418532
18,0.046065,0.814097,0.068118,0.251562,0.920359,0.262917,0.931307,0.386863,0.327075,0.661551,0.599980,0.200320,0.215759,0.696294,0.387989,0.280624,0.057899,0.704579,0.374159,0.038255
19,0.452513,0.353886,0.711643,0.533894,0.562923,0.470587,0.737032,0.792225,0.136058,0.333812,0.979820,0.674729,0.635383,0.344049,0.321656,0.070694,0.032098,0.116067,0.485385,0.982175
20,0.372846,0.780937,0.459429,0.200725,0.161684,0.715728,0.944163,0.192311,0.136694,0.136265,0.212657,0.416650,0.760069,0.387602,0.327468,0.725705,0.306684,0.376562,0.274191,0.573902
21,0.267254,0.392199,0.203739,0.566184,0.841520,0.208516,0.902471,0.844389,0.800759,0.293835,0.713210,0.505685,0.618947,0.536580,0.976880,0.876042,0.299727,0.312117,0.036556,0.395951
22,0.916951,0.305163,0.124275,0.955747,0.946493,0.001621,0.935822,0.867407,0.891882,0.638792,0.623882,0.531653,0.700739,0.943754,0.920008,0.059519,0.069886,0.132756,0.804875,0.530391
23,0.824535,0.518169,0.918161,0.499778,0.033621,0.939210,0.407801,0.019546,0.493509,0.932570,0.255332,0.389731,0.910520,0.073835,0.176300,0.283608,0.507395,0.421995,0.760069,0.394868
24,0.607328,0.773616,0.729217,0.756172,0.913376,0.836926,0.199257,0.515058,0.336257,0.659011,0.327828,0.635370,0.103138,0.961891,0.051079,0.312110,0.746404,0.629251,0.712154,0.711134
25,0.247067,0.324617,0.692589,0.249096,0.991421,0.897452,0.106610,0.301269,0.872962,0.987995,0.450058,0.345801,0.069991,0.275131,0.468789,0.232470,0.843698,0.692472,0.849921,0.473912
26,0.825785,0.504108,0.681742,0.570487,0.635793,0.209706,0.177190,0.039592,0.401252,0.150066,0.551681,0.996072,0.792016,0.744391,0.922127,0.012103,0.554446,0.815144,0.838758,0.205065
27,0.919856,0.962686,0.681316,0.085829,0.908545,0.780892,0.481760,0.703279,0.636721,0.470179,0.759116,0.845047,0.333433,0.605932,0.939668,0.262343,0.545897,0.288378,0.709963,0.882881
28,0.160112,0.741004,0.629360,0.761016,0.873740,0.637767,0.593307,0.040067,0.491534,0.314992,0.117019,0.282527,0.959779,0.182309,0.693848,0.268124,0.065262,0.870963,0.463070,0.735112
29,0.695940,0.799436,0.553548,0.014438,0.963818,0.238133,0.729245,0.652552,0.685078,0.266014,0.460237,0.030157,0.245575,0.835040,0.237677,0.894573,0.980304,0.175439,0.497805,0.965101
30,0.954873,0.471405,0.512003,0.006075,0.760201,0.794592,0.755477,0.839641,0.801388,0.280193,0.278110,0.854224,0.877100,0.830628,0.427221,0.961453,0.858161,0.145231,0.218538,0.527085
31,0.238410,0.603879,0.088306,0.457452,0.365656,0.325170,0.278026,0.761841,0.625931,0.933132,0.828648,0.824609,0.881473,0.425760,0.652513,0.341537,0.938648,0.553928,0.050400,0.709751
32,0.032549,0.998471,0.361755,0.793278,0.888251,0.902240,0.055410,0.873995,0.508319,0.724727,0.882537,0.009018,0.594632,0.512450,0.852893,0.194953,0.572095,0.276880,0.418022,0.975082
33,0.799435,0.188771,0.348087,0.827590,0.429683,0.778064,0.263402,0.414801,0.329709,0.350983,0.229349,0.959789,0.403403,0.561176,0.427150,0.014064,0.062885,0.823621,0.526198,0.524718
34,0.326003,0.240392,0.320192,0.185826,0.781117,0.787809,0.688840,0.611059,0.546762,0.479855,0.601740,0.489199,0.063815,0.803133,0.851534,0.094971,0.392943,0.777015,0.524941,0.859832
35,0.740841,0.426284,0.829805,0.649803,0.446847,0.915478,0.136855,0.843581,0.160368,0.625422,0.597212,0.179850,0.312134,0.013709,0.519651,0.559859,0.032852,0.346527,0.872408,0.850470
36,0.096657,0.015282,0.916177,0.779629,0.664811,0.423051,0.638299,0.498983,0.085291,0.965635,0.604901,0.715222,0.893793,0.326526,0.222102,0.611793,0.321467,0.172299,0.405162,0.865265
37,0.301537,0.934158,0.783154,0.829410,0.414721,0.196546,0.727452,0.780756,0.054329,0.531525,0.189417,0.263690,0.057906,0.327704,0.301747,0.587252,0.728893,0.697364,0.778585,0.956750
38,0.767760,0.501677,0.039705,0.080631,0.316816,0.850122,0.399180,0.089317,0.866582,0.265238,0.313504,0.043429,0.675221,0.960807,0.626839,0.805707,0.145171,0.312125,0.465520,0.947684
39,0.131456,0.023282,0.037317,0.927371,0.541397,0.316387,0.539451,0.907426,0.585105,0.391774,0.491164,0.566977,0.794668,0.505896,0.044551,0.934416,0.472960,0.394004,0.001381,0.519073
40,0.573684,0.608469,0.537651,0.410218,0.297998,0.724902,0.060797,0.599813,0.503413,0.222308,0.344391,0.862246,0.600302,0.367740,0.913386,0.368547,0.520580,0.966125,0.233912,0.164761
41,0.237287,0.874768,0.442552,0.305974,0.422038,0.317857,0.395358,0.871525,0.630601,0.811731,0.491276,0.365568,0.262415,0.107040,0.308703,0.325479,0.639190,0.649269,0.491121,0.395235
42,0.969871,0.183314,0.447078,0.329426,0.399800,0.933182,0.662498,0.682266,0.653175,0.186404,0.373717,0.763367,0.528556,0.188718,0.176158,0.173039,0.520925,0.669903,0.392719,0.986720
43,0.493237,0.797411,0.489101,0.489447,0.615221,0.491031,0.439888,0.446734,0.694714,0.355448,0.606398,0.647675,0.881642,0.593293,0.824936,0.765820,0.069553,0.550014,0.768573,0.539578
44,0.120590,0.317317,0.963087,0.666555,0.629362,0.755580,0.188166,0.850361,0.813636,0.875629,0.970202,0.665255,0.771701,0.190623,0.382916,0.470938,0.640593,0.047543,0.771750,0.860769
45,0.151761,0.974824,0.372640,0.803575,0.624317,0.818221,0.896879,0.917326,0.702657,0.564182,0.922191,0.464130,0.973566,0.374511,0.842526,0.479188,0.842619,0.414379,0.911329,0.116002
46,0.235552,0.346690,0.058870,0.166752,0.463341,0.536022,0.229593,0.370540,0.802981,0.599768,0.073492,0.258199,0.069052,0.964137,0.240429,0.756970,0.536640,0.035452,0.136057,0.700849
47,0.906946,0.961797,0.089682,0.943911,0.976907,0.890543,0.185973,0.731789,0.382665,0.393727,0.558190,0.039494,0.783018,0.988728,0.767534,0.670290,0.022101,0.718539,0.113686,0.219440
48,0.303378,0.715358,0.079281,0.342953,0.590160,0.772860,0.174633,0.822481,0.650043,0.588142,0.531649,0.854763,0.563471,0.496599,0.832226,0.364062,0.561014,0.393234,0.235549,0.630661
49,0.885753,0.553624,0.782712,0.645673,0.802494,0.272341,0.337532,0.971227,0.049283,0.530783,0.119695,0.695574,0.772160,0.061114,0.996042,0.799499,0.755830,0.970317,0.853480,0.259768

In [12]:
df

    Name Age
0  Uzair  20
1  Abbas  19
2  Lahad  21
3   Razi  22
4  Bilal  19

In [13]:
# how to rename column names
df=pd.DataFrame({'A col ':[1,2,3,4,5],'B col ': [20,19,18,17,16]})

In [14]:
df.rename(columns={'A col': 'a col','B col':'b col'}, inplace=True)

In [15]:
df

   A col   B col
0       1      20
1       2      19
2       3      18
3       4      17
4       5      16

In [16]:
df.columns=['aa_col','bb_col']

In [17]:
df

   aa_col  bb_col
0       1      20
1       2      19
2       3      18
3       4      17
4       5      16

In [18]:
# to replace any character, string, lateral
df.columns=df.columns.str.replace('_',' ')

In [19]:
df

   aa col  bb col
0       1      20
1       2      19
2       3      18
3       4      17
4       5      16

In [20]:
# adding prefix
df.add_prefix('UHS_')

   UHS_aa col  UHS_bb col
0           1          20
1           2          19
2           3          18
3           4          17
4           5          16

In [21]:
# adding suffix
df.add_suffix('_UHS')

   aa col_UHS  bb col_UHS
0           1          20
1           2          19
2           3          18
3           4          17
4           5          16

# 4 using template data

In [22]:
import pandas as pd
import numpy as np
import seaborn as sns

kashti = sns.load_dataset('titanic')
kashti.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [23]:
#  summary
kashti.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [24]:
# cloumns names
kashti.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [25]:
# saving a template dataset

kashti.to_csv('kashti.csv')

In [26]:
# saving to excel
kashti.to_excel('kashti.xlsx')

In [27]:
# viewing csv file
kashti=pd.read_csv('kashti.csv')
kashti

,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [28]:
# reading excel file
kashti=pd.read_excel('kashti.xlsx')
kashti

,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [29]:
# to text file
kashti.to_csv('kashti.txt',sep='\t')

In [30]:
#  reading text file
kashti=pd.read_csv('kashti.txt',sep='\t')
kashti

,Unnamed: 0.1,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,2,2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,3,3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,4,4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,887,887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,888,888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,889,889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,890,890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

# 5 using your own data

In [31]:
import pandas as pd
df = pd.read_csv('database.csv')
df

,Date,Time,Latitude,Longitude,Type,Depth,Depth Error,Depth Seismic Stations,Magnitude,Magnitude Type,...,Magnitude Seismic Stations,Azimuthal Gap,Horizontal Distance,Horizontal Error,Root Mean Square,ID,Source,Location Source,Magnitude Source,Status
0,01/02/1965,13:44:18,19.2460,145.6160,Earthquake,131.60,NaN,NaN,6.0,MW,...,NaN,NaN,NaN,NaN,NaN,ISCGEM860706,ISCGEM,ISCGEM,ISCGEM,Automatic
1,01/04/1965,11:29:49,1.8630,127.3520,Earthquake,80.00,NaN,NaN,5.8,MW,...,NaN,NaN,NaN,NaN,NaN,ISCGEM860737,ISCGEM,ISCGEM,ISCGEM,Automatic
2,01/05/1965,18:05:58,-20.5790,-173.9720,Earthquake,20.00,NaN,NaN,6.2,MW,...,NaN,NaN,NaN,NaN,NaN,ISCGEM860762,ISCGEM,ISCGEM,ISCGEM,Automatic
3,01/08/1965,18:49:43,-59.0760,-23.5570,Earthquake,15.00,NaN,NaN,5.8,MW,...,NaN,NaN,NaN,NaN,NaN,ISCGEM860856,ISCGEM,ISCGEM,ISCGEM,Automatic
4,01/09/1965,13:32:50,11.9380,126.4270,Earthquake,15.00,NaN,NaN,5.8,MW,...,NaN,NaN,NaN,NaN,NaN,ISCGEM860890,ISCGEM,ISCGEM,ISCGEM,Automatic
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
23407,12/28/2016,08:22:12,38.3917,-118.8941,Earthquake,12.30,1.2,40.0,5.6,ML,...,18.0,42.47,0.120,NaN,0.1898,NN00570710,NN,NN,NN,Reviewed
23408,12/28/2016,09:13:47,38.3777,-118.8957,Earthquake,8.80,2.0,33.0,5.5,ML,...,18.0,48.58,0.129,NaN,0.2187,NN00570744,NN,NN,NN,Reviewed
23409,12/28/2016,12:38:51,36.9179,140.4262,Earthquake,10.00,1.8,NaN,5.9,MWW,...,NaN,91.00,0.992,4.8,1.5200,US10007NAF,US,US,US,Reviewed
23410,12/29/2016,22:30:19,-9.0283,118.6639,Earthquake,79.00,1.8,NaN,6.3,MWW,...,NaN,26.00,3.553,6.0,1.4300,US10007NL0,US,US,US,Reviewed
23411,12/30/2016,20:08:28,37.3973,141.4103,Earthquake,11.94,2.2,NaN,5.5,MB,...,428.0,97.00,0.681,4.5,0.9100,US10007NTD,US,US,US,Reviewed

In [32]:
df.head()

,Date,Time,Latitude,Longitude,Type,Depth,Depth Error,Depth Seismic Stations,Magnitude,Magnitude Type,...,Magnitude Seismic Stations,Azimuthal Gap,Horizontal Distance,Horizontal Error,Root Mean Square,ID,Source,Location Source,Magnitude Source,Status
0,01/02/1965,13:44:18,19.246,145.616,Earthquake,131.6,NaN,NaN,6.0,MW,...,NaN,NaN,NaN,NaN,NaN,ISCGEM860706,ISCGEM,ISCGEM,ISCGEM,Automatic
1,01/04/1965,11:29:49,1.863,127.352,Earthquake,80.0,NaN,NaN,5.8,MW,...,NaN,NaN,NaN,NaN,NaN,ISCGEM860737,ISCGEM,ISCGEM,ISCGEM,Automatic
2,01/05/1965,18:05:58,-20.579,-173.972,Earthquake,20.0,NaN,NaN,6.2,MW,...,NaN,NaN,NaN,NaN,NaN,ISCGEM860762,ISCGEM,ISCGEM,ISCGEM,Automatic
3,01/08/1965,18:49:43,-59.076,-23.557,Earthquake,15.0,NaN,NaN,5.8,MW,...,NaN,NaN,NaN,NaN,NaN,ISCGEM860856,ISCGEM,ISCGEM,ISCGEM,Automatic
4,01/09/1965,13:32:50,11.938,126.427,Earthquake,15.0,NaN,NaN,5.8,MW,...,NaN,NaN,NaN,NaN,NaN,ISCGEM860890,ISCGEM,ISCGEM,ISCGEM,Automatic

# 6 reverse row order

In [33]:
import pandas as pd
import seaborn as sns

df=sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [34]:
df.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

In [35]:
# to check in descending order
df.loc[::-1].head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True

In [36]:
df.loc[::-1].reset_index(drop=True).head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True
1,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
2,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
3,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
4,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True

# 7- reverse colun order

In [37]:
df.loc[:,::-1].head()

,alone,alive,embark_town,deck,adult_male,who,class,embarked,fare,parch,sibsp,age,sex,pclass,survived
0,False,no,Southampton,NaN,True,man,Third,S,7.2500,0,1,22.0,male,3,0
1,False,yes,Cherbourg,C,False,woman,First,C,71.2833,0,1,38.0,female,1,1
2,True,yes,Southampton,NaN,False,woman,Third,S,7.9250,0,0,26.0,female,3,1
3,False,yes,Southampton,C,False,woman,First,S,53.1000,0,1,35.0,female,1,1
4,True,no,Southampton,NaN,True,man,Third,S,8.0500,0,0,35.0,male,3,0

# 8- select a cloumn by a data type

In [38]:
df.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [39]:
# only select those having numeric datatype

df.select_dtypes(include=['number']).head()

   survived  pclass   age  sibsp  parch     fare
0         0       3  22.0      1      0   7.2500
1         1       1  38.0      1      0  71.2833
2         1       3  26.0      0      0   7.9250
3         1       1  35.0      1      0  53.1000
4         0       3  35.0      0      0   8.0500

In [40]:
#  those with float
df.select_dtypes(include=['float']).head()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [41]:
#  those with object
df.select_dtypes(include=['object']).head()

      sex embarked    who  embark_town alive
0    male        S    man  Southampton    no
1  female        C  woman    Cherbourg   yes
2  female        S  woman  Southampton   yes
3  female        S  woman  Southampton   yes
4    male        S    man  Southampton    no

In [42]:
#  those with multiple datatypes
df.select_dtypes(include=['float','number','object']).head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,who,embark_town,alive
0,0,3,male,22.0,1,0,7.2500,S,man,Southampton,no
1,1,1,female,38.0,1,0,71.2833,C,woman,Cherbourg,yes
2,1,3,female,26.0,0,0,7.9250,S,woman,Southampton,yes
3,1,1,female,35.0,1,0,53.1000,S,woman,Southampton,yes
4,0,3,male,35.0,0,0,8.0500,S,man,Southampton,no

In [43]:
df.select_dtypes(exclude=['number']).head()

      sex embarked  class    who  adult_male deck  embark_town alive  alone
0    male        S  Third    man        True  NaN  Southampton    no  False
1  female        C  First  woman       False    C    Cherbourg   yes  False
2  female        S  Third  woman       False  NaN  Southampton   yes   True
3  female        S  First  woman       False    C  Southampton   yes  False
4    male        S  Third    man        True  NaN  Southampton    no   True

# 9- convert numbers into strings

In [44]:
# creating a dataframe
df = pd.DataFrame({'col a' : ['1','2','3','4','5'],
                   'col b':['6','7','8','9','10']})
df

  col a col b
0     1     6
1     2     7
2     3     8
3     4     9
4     5    10

In [45]:
df.dtypes

col a    object
col b    object
dtype: object

In [46]:
# changing datatype to numeric
pd.to_numeric(df['col a'],errors='coerce')
df.dtypes

col a    object
col b    object
dtype: object

In [47]:
#  changing type object to int
df=df.astype({'col a':'int','col b':'object'})

In [48]:
df.dtypes

col a     int32
col b    object
dtype: object

In [49]:
# changing datatype to numeric
df=pd.to_numeric(df['col b'],errors='coerce')

# 10- reduce dataframe size

In [50]:
df=sns.load_dataset('titanic')

In [51]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [52]:
#  checking the memory usage by this dataset in our computer
df.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 313.7 KB

In [53]:
# reducing the size by taking a fraction of whole dataset
df.sample(frac=0.1).shape

(89, 15)

In [54]:
#  taking 0.5 fraction of whole dataset
df.sample(frac=0.5).shape

(446, 15)

# 11- copy data from clipboard

In [55]:
# dataset download
import seaborn as sns
import pandas as pd

df=sns.load_dataset('titanic')
df.to_excel('kashti.xlsx')

In [56]:
# read clipboard in python
df=pd.read_clipboard()
df

Empty DataFrame
Columns: [https://workupload.com/file/yTDzEqdkPwG]
Index: []

# 12 - split data sets in two frames

In [57]:
# dataset download
import seaborn as sns
import pandas as pd

df=sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [58]:
len(df)

891

In [59]:
df.shape

(891, 15)

In [60]:
# we have one sample of data set
from random import random
kashti_1 = df.sample(frac=0.5,random_state=1)
kashti_1.shape

(446, 15)

In [61]:
#  then we just dropped taken dataset from whole dataset
kashti_2= df.drop(kashti_1.index)
kashti_2.shape

(445, 15)

In [62]:
kashti_1.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
862,1,1,female,48.0,0,0,25.9292,S,First,woman,False,D,Southampton,yes,True
223,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
84,1,2,female,17.0,0,0,10.5000,S,Second,woman,False,NaN,Southampton,yes,True
680,0,3,female,NaN,0,0,8.1375,Q,Third,woman,False,NaN,Queenstown,no,True
535,1,2,female,7.0,0,2,26.2500,S,Second,child,False,NaN,Southampton,yes,False

In [63]:
kashti_2.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
15,1,2,female,55.0,0,0,16.0000,S,Second,woman,False,NaN,Southampton,yes,True
18,0,3,female,31.0,1,0,18.0000,S,Third,woman,False,NaN,Southampton,no,False

In [64]:
df.shape

(891, 15)

In [65]:
len(kashti_1) + len(kashti_2)

891

# 13 - joining dataset into one dataframe

In [66]:
df1=kashti_1.append(kashti_2)
df1.shape

C:\Users\Administrator\AppData\Local\Temp\ipykernel_5768\805721718.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1=kashti_1.append(kashti_2)

(891, 15)

# 14 - filtering a data set

In [67]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [68]:
df.sex.unique()

array(['male', 'female'], dtype=object)

In [69]:
df[df.sex=="male"]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
883,0,2,male,28.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True
884,0,3,male,25.0,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [70]:
df[df.sex=="female"]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
880,1,2,female,25.0,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
882,0,3,female,22.0,0,0,10.5167,S,Third,woman,False,NaN,Southampton,no,True
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

In [71]:
df.age.unique()

array([22.  , 38.  , 26.  , 35.  ,   nan, 54.  ,  2.  , 27.  , 14.  ,
        4.  , 58.  , 20.  , 39.  , 55.  , 31.  , 34.  , 15.  , 28.  ,
        8.  , 19.  , 40.  , 66.  , 42.  , 21.  , 18.  ,  3.  ,  7.  ,
       49.  , 29.  , 65.  , 28.5 ,  5.  , 11.  , 45.  , 17.  , 32.  ,
       16.  , 25.  ,  0.83, 30.  , 33.  , 23.  , 24.  , 46.  , 59.  ,
       71.  , 37.  , 47.  , 14.5 , 70.5 , 32.5 , 12.  ,  9.  , 36.5 ,
       51.  , 55.5 , 40.5 , 44.  ,  1.  , 61.  , 56.  , 50.  , 36.  ,
       45.5 , 20.5 , 62.  , 41.  , 52.  , 63.  , 23.5 ,  0.92, 43.  ,
       60.  , 10.  , 64.  , 13.  , 48.  ,  0.75, 53.  , 57.  , 80.  ,
       70.  , 24.5 ,  6.  ,  0.67, 30.5 ,  0.42, 34.5 , 74.  ])

In [72]:
df.embarked.unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [73]:
df[(df.embarked=="S")].shape

(644, 15)

In [74]:
df[((df.embark_town=="Southampton") |
    (df.embark_town=="Queenstown")) & 
    (df.sex=="female")]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
880,1,2,female,25.0,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
882,0,3,female,22.0,0,0,10.5167,S,Third,woman,False,NaN,Southampton,no,True
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

In [75]:
df[df.embark_town.isin(['Queenstown','Southampton'])].head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True

In [76]:
df[df.age > 30].shape
# df[df.age < 30].shape

(305, 15)

# 15 filtering by large categories

In [77]:
df.embark_town.value_counts()

Southampton    644
Cherbourg      168
Queenstown      77
Name: embark_town, dtype: int64

In [78]:
df.sex.value_counts()

male      577
female    314
Name: sex, dtype: int64

In [79]:
df.age.value_counts().nlargest(5)

24.0    30
22.0    27
18.0    26
19.0    25
28.0    25
Name: age, dtype: int64

In [80]:
counts= df.embark_town.value_counts()
counts.nlargest(3)

Southampton    644
Cherbourg      168
Queenstown      77
Name: embark_town, dtype: int64

In [81]:
counts= df.who.value_counts()
counts.nlargest(3)

man      537
woman    271
child     83
Name: who, dtype: int64

In [82]:
df[df.who.isin(counts.nlargest(1).index)].head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
12,0,3,male,20.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

# 16 - splitting a string into multiple cloumns

In [83]:
#  import libraries
import pandas as pd

#  read dataset
df=pd.DataFrame({'Name':['Uzair Hussain','Mirza Abbas','Abdul Lahad','Razi Khanzada'],
                        'Location':['Karachi Pakistan','Nawabshah Pakistan','Dadu Pakistan','Hyderabad Pakistan']})
df

            Name            Location
0  Uzair Hussain    Karachi Pakistan
1    Mirza Abbas  Nawabshah Pakistan
2    Abdul Lahad       Dadu Pakistan
3  Razi Khanzada  Hyderabad Pakistan

In [84]:
# splitting into two columns
df[["first name","last name"]] = df.Name.str.split(' ',expand=True)

In [85]:
# printing those two columns as well
df

            Name            Location first name last name
0  Uzair Hussain    Karachi Pakistan      Uzair   Hussain
1    Mirza Abbas  Nawabshah Pakistan      Mirza     Abbas
2    Abdul Lahad       Dadu Pakistan      Abdul     Lahad
3  Razi Khanzada  Hyderabad Pakistan       Razi  Khanzada

In [86]:
# splitting location into two columns
df[["city","country"]] = df.Location.str.split(' ',expand=True)

In [87]:
# printing those two columns as well
df

            Name            Location first name last name       city   country
0  Uzair Hussain    Karachi Pakistan      Uzair   Hussain    Karachi  Pakistan
1    Mirza Abbas  Nawabshah Pakistan      Mirza     Abbas  Nawabshah  Pakistan
2    Abdul Lahad       Dadu Pakistan      Abdul     Lahad       Dadu  Pakistan
3  Razi Khanzada  Hyderabad Pakistan       Razi  Khanzada  Hyderabad  Pakistan

In [88]:
# refined dataset
df = df[["first name","last name","city","country"]]
df

  first name last name       city   country
0      Uzair   Hussain    Karachi  Pakistan
1      Mirza     Abbas  Nawabshah  Pakistan
2      Abdul     Lahad       Dadu  Pakistan
3       Razi  Khanzada  Hyderabad  Pakistan

# 17 - Aggregate by multiple groups/functions

In [89]:
# import libraries
import pandas as pd
import numpy as np
import seaborn as sns

# checking dataset available in seaborn library
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic']

In [90]:
# import dataset
df=sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [91]:
df.groupby('who').count()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,adult_male,deck,embark_town,alive,alone
who,,,,,,,,,,,,,,
child,83,83,83,83,83,83,83,83,83,83,13,83,83,83
man,537,537,537,413,537,537,537,537,537,537,99,537,537,537
woman,271,271,271,218,271,271,271,269,271,271,91,269,271,271

In [92]:
df.groupby('who').sum()

C:\Users\Administrator\AppData\Local\Temp\ipykernel_5768\2979829937.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('who').sum()

       survived  pclass       age  sibsp  parch        fare  adult_male  alone
who
child        49     218    528.67    144    105   2721.2210           0      6
man          88    1274  13700.50    159     82  13352.0656         537    410
woman       205     565   6976.00    163    153  12620.6627           0    121

In [93]:
len(df.groupby('sex'))

2

In [94]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [95]:
df.groupby(['sex','pclass','who']).count()

                     survived  age  sibsp  parch  fare  embarked  class  \
sex    pclass who
female 1      child         3    3      3      3     3         3      3
              woman        91   82     91     91    91        89     91
       2      child        10   10     10     10    10        10     10
              woman        66   64     66     66    66        66     66
       3      child        30   30     30     30    30        30     30
              woman       114   72    114    114   114       114    114
male   1      child         3    3      3      3     3         3      3
              man         119   98    119    119   119       119    119
       2      child         9    9      9      9     9         9      9
              man          99   90     99     99    99        99     99
       3      child        28   28     28     28    28        28     28
              man         319  225    319    319   319       319    319

                     adult_male  deck  embark_town  alive  alone
sex    pclass who
female 1      child           3     3            3      3      3
              woman          91    78           89     91     91
       2      child          10     1           10     10     10
              woman          66     9           66     66     66
       3      child          30     2           30     30     30
              woman         114     4          114    114    114
male   1      child           3     3            3      3      3
              man           119    91          119    119    119
       2      child           9     3            9      9      9
              man            99     3           99     99     99
       3      child          28     1           28     28     28
              man           319     5          319    319    319

In [96]:
df.groupby(['sex','pclass','embarked']).count()

                        survived  age  sibsp  parch  fare  class  who  \
sex    pclass embarked
female 1      C               43   38     43     43    43     43   43
              Q                1    1      1      1     1      1    1
              S               48   44     48     48    48     48   48
       2      C                7    7      7      7     7      7    7
              Q                2    1      2      2     2      2    2
              S               67   66     67     67    67     67   67
       3      C               23   16     23     23    23     23   23
              Q               33   10     33     33    33     33   33
              S               88   76     88     88    88     88   88
male   1      C               42   36     42     42    42     42   42
              Q                1    1      1      1     1      1    1
              S               79   64     79     79    79     79   79
       2      C               10    8     10     10    10     10   10
              Q                1    1      1      1     1      1    1
              S               97   90     97     97    97     97   97
       3      C               43   25     43     43    43     43   43
              Q               39   14     39     39    39     39   39
              S              265  214    265    265   265    265  265

                        adult_male  deck  embark_town  alive  alone
sex    pclass embarked
female 1      C                 43    35           43     43     43
              Q                  1     1            1      1      1
              S                 48    43           48     48     48
       2      C                  7     1            7      7      7
              Q                  2     1            2      2      2
              S                 67     8           67     67     67
       3      C                 23     1           23     23     23
              Q                 33     0           33     33     33
              S                 88     5           88     88     88
male   1      C                 42    31           42     42     42
              Q                  1     1            1      1      1
              S                 79    62           79     79     79
       2      C                 10     1           10     10     10
              Q                  1     0            1      1      1
              S                 97     5           97     97     97
       3      C                 43     0           43     43     43
              Q                 39     1           39     39     39
              S                265     5          265    265    265

In [97]:
df.groupby(['sex','pclass','embark_town']).count()

                           survived  age  sibsp  parch  fare  embarked  class  \
sex    pclass embark_town
female 1      Cherbourg          43   38     43     43    43        43     43
              Queenstown          1    1      1      1     1         1      1
              Southampton        48   44     48     48    48        48     48
       2      Cherbourg           7    7      7      7     7         7      7
              Queenstown          2    1      2      2     2         2      2
              Southampton        67   66     67     67    67        67     67
       3      Cherbourg          23   16     23     23    23        23     23
              Queenstown         33   10     33     33    33        33     33
              Southampton        88   76     88     88    88        88     88
male   1      Cherbourg          42   36     42     42    42        42     42
              Queenstown          1    1      1      1     1         1      1
              Southampton        79   64     79     79    79        79     79
       2      Cherbourg          10    8     10     10    10        10     10
              Queenstown          1    1      1      1     1         1      1
              Southampton        97   90     97     97    97        97     97
       3      Cherbourg          43   25     43     43    43        43     43
              Queenstown         39   14     39     39    39        39     39
              Southampton       265  214    265    265   265       265    265

                           who  adult_male  deck  alive  alone
sex    pclass embark_town
female 1      Cherbourg     43          43    35     43     43
              Queenstown     1           1     1      1      1
              Southampton   48          48    43     48     48
       2      Cherbourg      7           7     1      7      7
              Queenstown     2           2     1      2      2
              Southampton   67          67     8     67     67
       3      Cherbourg     23          23     1     23     23
              Queenstown    33          33     0     33     33
              Southampton   88          88     5     88     88
male   1      Cherbourg     42          42    31     42     42
              Queenstown     1           1     1      1      1
              Southampton   79          79    62     79     79
       2      Cherbourg     10          10     1     10     10
              Queenstown     1           1     0      1      1
              Southampton   97          97     5     97     97
       3      Cherbourg     43          43     0     43     43
              Queenstown    39          39     1     39     39
              Southampton  265         265     5    265    265

# 18 - select specific rows and columns

In [98]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [99]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [100]:
df[['sex','class','age','parch']]

        sex   class   age  parch
0      male   Third  22.0      0
1    female   First  38.0      0
2    female   Third  26.0      0
3    female   First  35.0      0
4      male   Third  35.0      0
..      ...     ...   ...    ...
886    male  Second  27.0      0
887  female   First  19.0      0
888  female   Third   NaN      2
889    male   First  26.0      0
890    male   Third  32.0      0

[891 rows x 4 columns]

In [101]:
df.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [103]:
df[['sex','class']]

        sex   class
0      male   Third
1    female   First
2    female   Third
3    female   First
4      male   Third
..      ...     ...
886    male  Second
887  female   First
888  female   Third
889    male   First
890    male   Third

[891 rows x 2 columns]

In [104]:
df.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [114]:
# df.describe().loc[['min','25%','50%','75%','max']]
# or
df.describe().loc['min':'max','survived':'age']

     survived  pclass     age
min       0.0     1.0   0.420
25%       0.0     2.0  20.125
50%       0.0     3.0  28.000
75%       1.0     3.0  38.000
max       1.0     3.0  80.000

# 19- Reshape multiindex series

In [115]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [116]:
df.survived.mean()

0.3838383838383838

In [119]:
df.groupby(['sex','class']).survived.mean()

sex     class
female  First     0.968085
        Second    0.921053
        Third     0.500000
male    First     0.368852
        Second    0.157407
        Third     0.135447
Name: survived, dtype: float64

In [120]:
df.groupby(['sex','class']).survived.mean().unstack()

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

# 20- Continous to categorical data conversion

In [121]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [122]:
df.age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64